// Завдання 1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt('введіть число'));
// console.log(number);
// if (number === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }

// Завдання 2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"
// const min = Math.floor(Math.random() * 59);

// const min = Math.floor(Math.random() * 59);
// if (min < 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min < 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min < 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в четверту чверть`);
// }

// Завдання 3
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = prompt('Введіть число від 1 до 4 включно');
// let result;
// switch (num) {
//   case '1':
//     result = 'зима';
//     break;
//   case '2':
//     result = 'весна';
//     break;
//   case '3':
//     result = 'літо';
//     break;
//   case '4':
//     result = 'осінь';
//     break;
//   default:
//     result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
// }
// console.log(result);

// Завдання 4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

//paddedString = "abc".padStart(8, "0");

// const minutes = Number(prompt('Введіть кількість хвилин:'));
// const hours = Math.floor(minutes / 60);
// const remainingMinutes = minutes % 60;
// console.log (`${String(hours).padStart(2, "0")}:${String(remainingMinutes).padStart(2, "0")}`);

// Завдання 5
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt('Введіть логін');

// if (login === 'Адмін') {
//   const password = prompt('Введіть пароль');
//   password === 'Я головний' ? alert('Добрий день!') : alert('Невірний пароль!');
// } else if (login === null || login === '') {
//   alert('Скасовано');
// } else {
//   alert('Я вас не знаю');
// }

// Завдання 6
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// let counter = 0;

// while (counter <= 20) {
//   counter++;
//   console.log(`${counter}`);
// }

// Завдання 7
// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(`${i}`);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }
// console.log(getNumbers(3, 10));

// Завдання 8

// Завдання 10

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num) {
//   for (let i = 1; i < num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log(i, 'fizzbuzz');
//     } else if (i % 3 === 0) {
//       console.log(i, 'fizz');
//     } else if (i % 5 === 0) {
//       console.log(i, 'buzz');
//     }
//   }
// }

// fizzBuzz(16);

//  2. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt

// let number;

// while (true) {
//   number = prompt('Введіть число більше 100');
//   if (number === null || number === '') {
//     break;
//   }
//   number = Number(number);
//   if (number > 100) {
//     break;
//   }
// }

// 3. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

// function checkUrl(url) {
//   if (url.includes('my-site') && !url.endsWith('/')) {
//     return url + '/';
//   }
//   return url;
// }

// function checkUrl(url) {
//   if (url.includes('my-site') && !url.endsWith('/')) {
//     return url + '/';
//   }

//   return url;
// }

// // Перевірка
// console.log(checkUrl('https://my-site.com'));
// console.log(checkUrl('https://my-site.com/'));
// console.log(checkUrl('https://google.com'));
